package corejava.core1;
/*
Java白皮书中的关键术语：
简单性，Java比C++更易学习，Java剔除了C++中很少使用的难以理解的特性，很多语法也与C++相似。
面向对象，现代编程语言几乎都是面向对象的。
网络技能，Java的网络能力强大易用。
健壮性，Java采用指针模型而不是显示指针，可以消除重写内存和损坏数据的可能性。
安全性，Java可以构建防病毒，防篡改的系统，安全性能很高。
体系结构中立，Java编译器生成与特定计算机体系结构无关的字节码来实现这一特性，精心设计的字节码可以很容易地在任何机器上解释执行，而且还可以迅速翻译成本地机器代码。
可移植性，Java不存在依赖于具体实现的地方。所有的数据类型都是有固定大小的，二进制数据以固定的格式进行存储和传输，字符串用标准的Unicode格式存储。
解释型，Java解释器可以在任何移植了解释器的机器上执行Java字节码。
高性能，字节码（在运行时）可以快速的翻译成运行这个应用程序的特定的CPU机器码。
多线程，多线程可以带来更好地交互响应和实时行为。
动态性，可以将某些代码添加到正在运行的程序中。
*/
public class JavaKeywords
{

}
